chore: update readme and docs
